import time


class Order:
    """Класс Order содержит информацию о заказе."""

    # Переменная класса для определения номера заказа
    order_counter = 0

    def __init__(self):
        """Конструктор класса."""
        # Хранит экземпляры класса Pizza и его потомков
        self.ordered_pizzas = []
        Order.order_counter += 1

    def __str__(self):
        """Вернуть содержимое заказа и его сумму.

        Формат вывода:

        Заказ №2
        1. Пицца: Пепперони | Цена: 350.00 р.
           Тесто: тонкое Соус: томатный
           Начинка: пепперони, сыр моцарелла
        2. Пицца: Барбекю | Цена: 450.00 р.
           Тесто: тонкое Соус: барбекю
           Начинка: бекон, ветчина, зелень, сыр моцарелла
        Сумма заказа: 800.00 р.

        """
        res = f"Заказ №{Order.order_counter}\n"
        for i, pizza in enumerate(self.ordered_pizzas, 1):
            res += f"{i}. {pizza}\n"
        res += f"Сумма заказа: {self.total():.2f} р.\n"
        return res

    def add(self, pizza):
        """Добавить пиццу в заказ."""
        self.ordered_pizzas.append(pizza)

    def total(self):
        """Вернуть сумму заказа."""
        return sum(pizza.price for pizza in self.ordered_pizzas)

    def execute(self):
        """Выполнить заказ.

        Для каждой пиццы в заказе: подготовить, испечь, нарезать и упаковать.
        Сообщить, что заказ готов и пожелать приятного аппетита.

        Для визуального эффекта, каждое действие осуществляется с "задержкой",
        используя time.sleep(1).

        Формат вывода:

        Заказ поступил на выполнение...
        1. Пепперони
        Начинаю готовить пиццу Пепперони
          - замешиваю тонкое тесто...
          - добавляю соус: томатный...
          - и, конечно: пепперони, сыр моцарелла...
        Выпекаю пиццу... Готово!
        Нарезаю на аппетитные кусочки...
        Упаковываю в фирменную упаковку и готово!

        Заказ №2 готов! Приятного аппетита!
        """
        print(f"Заказ поступил на выполнение...")
        for pizza in self.ordered_pizzas:
            print(f"{pizza.name}")
            print(f"Начинаю готовить пиццу {pizza.name}")
            time.sleep(1)
            print(f"  - замешиваю {pizza.dough} тесто...")
            time.sleep(1)
            print(f"  - добавляю соус: {pizza.sauce}...")
            time.sleep(1)
            print(f"  - и, конечно: {', '.join(pizza.toppings)}...")
            time.sleep(1)
            print(f"Выпекаю пиццу... Готово!")
            time.sleep(1)
            print(f"Нарезаю на аппетитные кусочки...")
            time.sleep(1)
            print(f"Упаковываю в фирменную упаковку и готово!")
            time.sleep(1)
        print(f"Заказ №{Order.order_counter} готов! Приятного аппетита!")
