class Pizza:
    """Класс Pizza содержит общие атрибуты для пиццы.

    Дочерние классы будут их конкретизировать.
    """

    def __init__(self):
        """Конструктор класса.

        Инициализирует атрибуты пиццы (значения по умолчанию).
        """
        self.name = "Заготовка"
        self.dough = "тонкое"  # тонкое или пышное
        self.sauce = "кетчуп"  # или другой
        self.toppings = []     # список начинок (по умолчанию - нет)
        self.price = 0

    def __str__(self):
        """Вернуть информацию о пицце: название, тесто, соус, начинка.

        Формат вывода:

        Пицца: Пепперони | Цена: 350.00 р.
        Тесто: тонкое Соус: томатный
        Начинка: пепперони, сыр моцарелла
        """
        return (f"Пицца: {self.name} | Цена: {self.price:.2f} р.\n"
                f"Тесто: {self.dough} Соус: {self.sauce}\n"
                f"Начинка: {', '.join(self.toppings)}")

    def prepare(self):
        """Сообщить о процессе подготовки.

        Формат вывода:

        Начинаю готовить пиццу Пепперони
          - замешиваю тонкое тесто...
          - добавляю соус: томатный...
          - и, конечно: пепперони, сыр моцарелла...
        """
        print(f"Начинаю готовить пиццу {self.name}")
        print(f"  - замешиваю {self.dough} тесто...")
        print(f"  - добавляю соус: {self.sauce}...")
        print(f"  - и, конечно: {', '.join(self.toppings)}...")

    def bake(self):
        """Сообщить о процессе запекания пиццы.

        Формат вывода: произвольное сообщение.
        """
        print("Выпекаю пиццу... Готово!")

    def cut(self):
        """Сообщить о процессе нарезки.

        Формат вывода: произвольное сообщение.
        """
        print("Нарезаю на аппетитные кусочки...")

    def pack(self):
        """Сообщить о процессе упаковки.

        Формат вывода: произвольное сообщение.
        """
        print("Упаковываю в фирменную упаковку и готово!")


class PepperoniPizza(Pizza):
    """Класс PepperoniPizza дополняет класс Pizza."""

    def __init__(self):
        super().__init__()
        self.name = "Пепперони"
        self.dough = "тонкое"
        self.sauce = "томатный"
        self.toppings = ["пепперони", "сыр моцарелла"]
        self.price = 350.00


class BarbecuePizza(Pizza):
    """Класс BarbecuePizza дополняет класс Pizza."""

    def __init__(self):
        super().__init__()
        self.name = "Барбекю"
        self.dough = "тонкое"
        self.sauce = "барбекю"
        self.toppings = ["бекон", "ветчина", "зелень", "сыр моцарелла"]
        self.price = 450.00


class SeafoodPizza(Pizza):
    """Класс SeafoodPizza дополняет класс Pizza."""

    def __init__(self):
        super().__init__()
        self.name = "Дары моря"
        self.dough = "тонкое"
        self.sauce = "сливочный"
        self.toppings = ["креветки", "мидии", "кальмары", "сыр моцарелла"]
        self.price = 550.00
